# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [1]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

# File to Load (Remember to change these)
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

### Merge the DataFrames

In [2]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

## Deliverable 1: Get a Summary DataFrame

In [3]:
grouped_pyber_df = pyber_data_df.groupby(["type"])
print(grouped_pyber_df)
grouped_pyber_df.count().head(10)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001AE0F943F10>

          city  date  fare  ride_id  driver_count
type
Rural      125   125   125      125           125
Suburban   625   625   625      625           625
Urban     1625  1625  1625     1625          1625

In [4]:
#  1. Get the total rides for each city type
ride_count = grouped_pyber_df["ride_id"].count()
ride_count

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [5]:
# 2. Get the total drivers for each city type
driver_count_percity = city_data_df.groupby(["type"]).sum()["driver_count"]
driver_count_percity

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [6]:
#  3. Get the total amount of fares for each city type
fare_sum = grouped_pyber_df["fare"].sum()
fare_sum

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [7]:
#  4. Get the average fare per ride for each city type. 
avg_fare = fare_sum/ride_count
avg_fare

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
dtype: float64

In [8]:
# 5. Get the average fare per driver for each city type. 
avg_fare_driver = fare_sum/driver_count_percity
avg_fare_driver

type
Rural       55.486282
Suburban    39.502714
Urban       16.571468
dtype: float64

In [9]:
#  6. Create a PyBer summary DataFrame. 
pyber_summary_df = pd.DataFrame(
          {"Total Rides": ride_count, 
          "Total Drivers": driver_count_percity, 
          "Total Fares": fare_sum,
          "Average Fare per Ride": avg_fare, 
          "Average Fare per Driver": avg_fare_driver})

# Display the data frame
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
type,,,,,
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [10]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None

In [11]:
#  8. Format the columns.
pyber_summary_df["Total Rides"] = pyber_summary_df["Total Rides"].map("{:,}".format)
pyber_summary_df["Total Drivers"] = pyber_summary_df["Total Drivers"].map("{:,}".format)
pyber_summary_df["Total Fares"] = pyber_summary_df["Total Fares"].map("${:,.2f}".format)
pyber_summary_df["Average Fare per Ride"] = pyber_summary_df["Average Fare per Ride"].map("${:,.2f}".format)
pyber_summary_df["Average Fare per Driver"] = pyber_summary_df["Average Fare per Driver"].map("${:,.2f}".format)

# Display the data frame
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,"1,625","2,405","$39,854.38",$24.53,$16.57

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [12]:
# 1. Read the merged DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [20]:
#Separate date and time from date+timestamp
#df['new date']=[d.date() for d in [pyber_data]]
pyber_data_df['date']=pd.to_datetime(pyber_data_df['date']).dt.date
pyber_data_df.head()

                 city        date   fare        ride_id  driver_count   type
0  Lake Jonathanshire  2019-01-14  13.83  5739410935873             5  Urban
1  South Michelleport  2019-03-04  30.24  2343912425577            72  Urban
2  Port Samanthamouth  2019-02-24  33.44  2005065760003            57  Urban
3          Rodneyfort  2019-02-10  23.44  5149245426178            34  Urban
4          South Jack  2019-03-06  34.58  3908451377344            46  Urban

In [21]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.
sum_fares=pyber_data_df.groupby(["date", "type"]).sum()[["fare"]]
sum_fares.tail()

                       fare
date       type
2019-05-06 Urban     181.20
2019-05-07 Rural      44.94
           Suburban  274.09
           Urban     258.01
2019-05-08 Urban     170.82

In [22]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index()
sum_fares=sum_fares.reset_index()
sum_fares.tail()

           date      type    fare
329  2019-05-06     Urban  181.20
330  2019-05-07     Rural   44.94
331  2019-05-07  Suburban  274.09
332  2019-05-07     Urban  258.01
333  2019-05-08     Urban  170.82

In [23]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date. 
sum_fares_pivot=sum_fares.pivot(index="date", columns="type", values="fare")
sum_fares_pivot.tail(10)

type         Rural  Suburban   Urban
date
2019-04-29   67.60    167.92  342.63
2019-04-30   88.14    106.06  235.88
2019-05-01   22.44    143.53  253.57
2019-05-02   52.71    274.07  270.59
2019-05-03     NaN    226.71  430.23
2019-05-04     NaN     91.71  323.57
2019-05-05   26.53    154.78  322.10
2019-05-06  111.88     34.12  181.20
2019-05-07   44.94    274.09  258.01
2019-05-08     NaN       NaN  170.82

In [15]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.

In [16]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)

In [17]:
# 7. Check that the datatype for the index is datetime using df.info()

In [18]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.

In [19]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')